products/SoapServiceProducts/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getServiceRequest>
         <gs:serviceId>500</gs:serviceId>
      </gs:getServiceRequest>
   </soapenv:Body>
</soapenv:Envelope>
